/******************************************************************************
       2_kakudai.c
       画像を拡大する。(内挿を用いる)
       一部修正　柳瀬　2012/11/01
	   ファイル出入力を簡略化　馬路　2013/9/11　尾川先生公認
	   一部修正　伊藤　2016/9/16
******************************************************************************/
#include <stdio.h>
#include <stdlib.h>

#define SIZE 256

int main()
{

    int             i, j;
    unsigned char   f[ SIZE ][ SIZE ];/*入力画像*/
    unsigned char   g[ 2 * SIZE ][ 2 * SIZE ];/*拡大画像*/
    FILE            *fp1, *fp2;

    /**トリミング画像ファイル読み込み********************************/
    fp1 = fopen( "Brain_uchar_256-256.raw" , "rb" );
    fread( f , 1 , SIZE * SIZE , fp1 );
    fclose( fp1 );
    /****************************************************************/


    /**拡大画像の初期化**********************************************/
    for( i = 0 ; i < 2 * SIZE ; i++ )
    {
        for( j = 0 ; j < 2 * SIZE ; j++ )
        {
            g[ i ][ j ] = 0;
        }
    }
    /****************************************************************/


    /**↓↓プログラム作成開始↓↓************************************/
		for(i = 0;i< SIZE;i++){
        for(j = 0;j< SIZE;j++)
        {
            g[i*2][j*2] = f[i][j];
            g[i*2][j*2+1] = (f[i][j]+f[i][j+1])/2;
            g[i*2+1][j*2] = (f[i][j]+f[i+1][j])/2;
            g[i*2+1][j*2+1] = (f[i][j]+f[i][j+1]+f[i+1][j]+f[i+1][j+1])/4;
        }
    }

    /**↑↑プログラム作成終了↑↑************************************/


    /**拡大画像ファイル書き込み**************************************/
    fp2 = fopen( "Brain_uchar_512-512.raw" , "wb" );
    fwrite( g , 1 , 4 * SIZE * SIZE , fp2 );
    fclose( fp2 );
    /****************************************************************/

    return 0;
}

